<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"0965b943e51aa93e05f826886227305d9331330153e1bc3ef5a4aa1cdc13be86","plan_job_ref":"Job Run Terraform plan in staging #214 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/14107513631","plan_out_hash":"e2e03dce433ba3fdb4c0c9fce45b70ba573e2e3df5997750120b2f0049fc44a7","plan_hash":"db96d861eb4064083fb3f607f9330d0a6f2624da695df71ecccead18d88611e5","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudfoundry_app.app will be updated in-place
!~  resource "cloudfoundry_app" "app" {
!~      created_at                  = "2024-12-26T21:38:47Z" -> (known after apply)
+       disk_quota                  = (known after apply)
+       health_check_type           = (known after apply)
!~      id                          = "************************************" -> (known after apply)
+       instances                   = (known after apply)
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = (known after apply)
        name                        = "continuous_monitoring-staging"
+       readiness_health_check_type = (known after apply)
!~      source_code_hash            = "Pjb01xzmL5eBMif6IyldoHAA8p7GiBl3tQAzO8D2SVU=" -> "8K4skVfzf9tkny3Kv4x3KtpPCDH3vFgop2mfoAM71YY="
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-03-18T14:04:19Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # cloudfoundry_network_policy.egress_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "egress_routing" {
        id = "05a74ebf-eccc-3593-abce-90c94c007b39"

-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "8080" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
+       policy {
+           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5"
+           port            = "8080"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #214](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/14107513631)